{
    "architectures": [
        "MistralForCausalLM"
    ],
    "bos_token_id": 1,
    "eos_token_id": 2,
    "pad_token_id": 3,
    "hidden_act": "silu",
    "hidden_size": 1024,
    "initializer_range": 0.02,
    "intermediate_size": 2048,
    "max_position_embeddings": 32768,
    "model_type": "mistral",
    "num_attention_heads": 16,
    "num_hidden_layers": 30,
    "num_key_value_heads": 4,
    "rms_norm_eps": 1e-06,
    "rope_theta": 10000.0,
    "sliding_window": null,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.52.4",
    "use_cache": true,
    "vocab_size": 32000
}
